Template/soapVIO_SZVM.xml

<soap:Envelope xmlns:soap="http://www.w3.org/2003/05/soap-envelope" 
   xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance" 
   xmlns:wsa="http://www.w3.org/2005/08/addressing" 
   xmlns:mime="http://www.w3.org/2004/11/xmlmime" 
   xmlns:peer1="usrn:some.other.peer.1" 
   xmlns:m="http://r-style.com/2014/routing">
	<soap:Header>
		<wsa:MessageID>4ee7bc99bc8b4eb3a8eccca07ba8c71b</wsa:MessageID>
		<wsa:From>
			<wsa:Address>urn:region:203000:BPI</wsa:Address>
			<wsa:ReferenceParameters>
				<m:RequestId>c4683f01ad2e4aaf8441da81e076c439</m:RequestId>
				<m:ChannelType>ELECTRONIC</m:ChannelType>
				<m:DocumentKind>INBOUND</m:DocumentKind>
				<m:DocumentType>PACKAGE_SZVM</m:DocumentType>
				<m:ReceiveDate>2016-05-10T21:08:32+03:00</m:ReceiveDate>
				<m:Submitter>
					<m:Identifier>087-027-046326</m:Identifier>
					<m:Role>PAYER</m:Role>
				</m:Submitter>
				<m:Recipient>
					<m:Identifier>087-027</m:Identifier>
					<m:Role>OPFR</m:Role>
				</m:Recipient>
				<m:PeerBlock>
					<m:Identifier>BPI</m:Identifier>
					<m:PeerData>
						<peer1:IDDocumentFlow190R>uuid:e3da98a984b64da61ee825630145e1d1</peer1:IDDocumentFlow190R>
					</m:PeerData>
				</m:PeerBlock>
			</wsa:ReferenceParameters>
		</wsa:From>
		<wsa:Action>urn:process:4:1.0</wsa:Action>
	</soap:Header>
	<soap:Body>
		<m:Message>
			<m:data mime:contentType="application/zip">UEsDBBQAAAgIAAZ9rEhd</m:data>
		</m:Message>
	</soap:Body>
</soap:Envelope>